// setup homoglyph map to decipher discord messages into plain alphabetical characters
const a = ["a","A","ª","à","á","â","ã","ä","å","ā","ă","ą","ǎ","ǟ","ǡ","ǻ","ȁ","ȃ","ȧ","ɐ","ɑ","ɒ","ạ","ả","ấ","ầ","ẩ","ẫ","ậ","ắ","ằ","ẳ","ẵ","ặ","ⱥ","ꜳ","ꜵ","ꜷ","ꜹ","ꜻ","α","Α","а","А","ᴀ","ⓐ","Ⓐ","🄐","🄰","🅐","🅰","ａ","Ａ","𝐚","𝐀","𝑎","𝐴","𝒂","𝑨","𝒶","𝒜","𝓪","𝓐","𝔞","𝔄","𝕒","𝔸","𝕬","𝖆","𝖠","𝖺","𝗮","𝗔","𝘢","𝘈","𝙖","𝘼","𝙰","𝚊"];
const b = ["b","B","ß","ƀ","Ɓ","ɓ","ƃ","ḃ","ḅ","ḇ","ƅ","ᵬ","ᶀ","β","Β","ϐ","ϑ","Ь","Ᏼ","ᗷ","ʙ","ⓑ","Ⓑ","🄑","🄱","🅑","🅱","ｂ","Ｂ","𝐛","𝐁","𝑏","𝐵","𝒃","𝑩","𝒷","𝓑","𝓫","𝔟","𝔅","𝕓","𝔹","𝕭","𝖇","𝖡","𝖻","𝗯","𝗕","𝘣","𝘉","𝙗","𝘽","𝙱","𝚋"];
const c = ["c","C","ç","Ç","ć","Ć","ĉ","Ĉ","ċ","Ċ","č","Č","ƈ","Ƈ","ȼ","ḉ","ↄ","ɔ","ϲ","Ϲ","с","С","Ꮯ","ᴄ","ⓒ","Ⓒ","🄒","🄲","🅒","🅲","ｃ","Ｃ","𝐜","𝐂","𝑐","𝐶","𝒄","𝑪","𝒸","𝒞","𝓬","𝓒","𝔠","ℭ","𝕔","ℂ","𝕮","𝖈","𝖢","𝖼","𝗰","𝗖","𝘤","𝘊","𝙘","𝘾","𝙲","𝚌"];
const d = ["d","D","ď","Ď","đ","Đ","ƌ","Ɖ","ȡ","ɖ","ɗ","ḋ","ḍ","ḏ","ḑ","ḓ","ᵭ","ᶁ","ԁ","Ꭰ","ᴅ","ⓓ","Ⓓ","🄓","🄳","🅓","🅳","ｄ","Ｄ","𝐝","𝐃","𝑑","𝐷","𝒅","𝑫","𝒹","𝒟","𝓭","𝓓","𝔡","𝔇","𝕕","𝔻","𝕯","𝖉","𝖣","𝖽","𝗱","𝗗","𝘥","𝘋","𝙙","𝘿","𝙳","𝚍"];
const e = ["e","E","è","È","é","É","ê","Ê","ë","Ë","ē","Ē","ĕ","Ĕ","ė","Ė","ę","Ę","ě","Ě","ȅ","Ȅ","ȇ","Ȇ","ɇ","Ɇ","ɛ","Ɛ","ẹ","Ẹ","ẻ","Ẻ","ẽ","Ẽ","ế","Ế","ề","Ề","ể","Ể","ễ","Ễ","ệ","Ệ","ⱸ","е","Е","ε","Ε","ϵ","℮","ᴇ","ⓔ","Ⓔ","🄔","🄴","🅔","🅴","ｅ","Ｅ","𝐞","𝐄","𝑒","𝐸","𝒆","𝑬","ℯ","𝓔","𝓮","𝔢","𝔈","𝕖","𝔼","𝕰","𝖊","𝖤","𝖾","𝗲","𝗘","𝘦","𝘌","𝙚","𝙀","𝙴","𝚎"];
const f = ["f","F","ƒ","Ƒ","ḟ","Ḟ","ᵮ","ᶂ","ғ","Ғ","Ϝ","ⓕ","Ⓕ","🄕","🄵","🅕","🅵","ｆ","Ｆ","𝐟","𝐅","𝑓","𝐹","𝒇","𝑭","𝒻","𝓕","𝓯","𝔣","𝔉","𝕗","𝔽","𝕱","𝖋","𝖥","𝖿","𝗳","𝗙","𝘧","𝘍","𝙛","𝙁","𝙵","𝚏"];
const g = ["g","G","ĝ","Ĝ","ğ","Ğ","ġ","Ġ","ģ","Ģ","ǥ","Ǥ","ǧ","Ǧ","ǵ","Ǵ","ɠ","ɢ","ḡ","ᵷ","ᶃ","ɡ","ɞ","Ԍ","ԍ","ɢ","ⓖ","Ⓖ","🄖","🄶","🅖","🅶","ｇ","Ｇ","𝐠","𝐆","𝑔","𝐺","𝒈","𝑮","𝓰","𝒢","𝔤","𝔊","𝕘","𝔾","𝕲","𝖌","𝖦","𝗀","𝗴","𝗚","𝘨","𝘎","𝙜","𝙂","𝙶","𝚐"];
const h = ["h","H","ĥ","Ĥ","ħ","Ħ","ȟ","Ȟ","ɥ","ɦ","ʰ","ḣ","Ḣ","ḥ","Ḥ","ḧ","Ḧ","ḩ","Ḩ","ḫ","Ḫ","ⱨ","Ⱨ","һ","Һ","Η","η","Ꮋ","ʜ","ⓗ","Ⓗ","🄗","🄷","🅗","🅷","ｈ","Ｈ","𝐡","𝐇","𝒉","𝑯","𝒽","ℋ","𝓱","𝓗","𝔥","ℌ","𝕙","ℍ","𝕳","𝖍","𝖧","𝗁","𝗵","𝗛","𝘩","𝘏","𝙝","𝙃","𝙷","𝚑"];
const i = ["i","I","ì","Ì","í","Í","î","Î","ï","Ï","ĩ","Ĩ","ī","Ī","ĭ","Ĭ","į","Į","ı","ǐ","Ǐ","ȉ","Ȉ","ȋ","Ȋ","ɨ","Ɨ","ɩ","ᵻ","ḭ","Ḭ","ỉ","Ỉ","ị","Ị","ι","Ι","і","І","ӏ","Ӏ","Ꭵ","ɪ","ⓘ","Ⓘ","🄘","🄸","🅘","🅸","ｉ","Ｉ","𝐢","𝐈","𝑖","𝐼","𝒊","𝑰","𝒾","ℐ","𝓲","𝓘","𝔦","ℑ","𝕚","𝕀","𝕴","𝖎","𝖨","𝗂","𝗶","𝗜","𝘪","𝘐","𝙞","𝙄","𝙸","𝚒","!"];
const j = ["j","J","ĵ","Ĵ","ǰ","ɉ","Ɉ","ʝ","ɟ","ʲ","ĵ","ḱ","ј","Ј","Ꭻ","ᴊ","ⓙ","Ⓙ","🄙","🄹","🅙","🅹","ｊ","Ｊ","𝐣","𝐉","𝑗","𝐽","𝒋","𝑱","𝒿","𝒥","𝓳","𝓙","𝔧","𝔍","𝕛","𝕁","𝕵","𝖏","𝖩","𝗃","𝗷","𝗝","𝘫","𝘑","𝙟","𝙅","𝙹","𝚓"];
const k = ["k","K","ķ","Ķ","ƙ","Ƙ","ǩ","Ǩ","ⱪ","Ⱪ","ʞ","ᴋ","ḱ","Ḱ","ḳ","Ḳ","ḵ","Ḵ","κ","Κ","к","К","Ꮶ","ⓚ","⒦","🄚","🄺","🅚","🅺","ｋ","Ｋ","𝐤","𝐊","𝑘","𝐾","𝒌","𝑲","𝓀","𝒦","𝓴","𝓚","𝔨","𝔎","𝕜","𝕂","𝕶","𝖐","𝖪","𝗄","𝗸","𝗞","𝘬","𝘒","𝙠","𝙆","𝙺","𝚔"];
const l = ["l","L","ĺ","Ĺ","ļ","Ļ","ľ","Ľ","ŀ","Ŀ","ł","Ł","ƚ","ȴ","ɫ","ɬ","ḷ","Ḷ","ḹ","Ḹ","ḽ","Ḽ","ḻ","Ḻ","ⅼ","Ι","ӏ","Ӏ","ⅼ","Ꮮ","ʟ","ⓛ","⒧","🄛","🄻","🅛","🅻","ｌ","Ｌ","𝐥","𝐋","𝑙","𝐿","𝒍","𝑳","𝓁","ℒ","𝓵","𝓛","𝔩","𝔏","𝕝","𝕃","𝕷","𝖑","𝖫","𝗅","𝗹","𝗟","𝘭","𝘓","𝙡","𝙇","𝙻","𝚕"];
const m = ["m","M","ɱ","Ɯ","ḿ","Ḿ","ṁ","Ṁ","ṃ","Ṃ","ᵯ","ᶆ","ｍ","Ｍ","Μ","μ","м","М","Ꮇ","ᴍ","ⓜ","⒨","🄜","🄼","🅜","🅼","𝐦","𝐌","𝑚","𝑀","𝒎","𝑴","𝓂","ℳ","𝓶","𝓜","𝔪","𝔐","𝕞","𝕄","𝕸","𝖒","𝖬","𝗆","𝗺","𝗠","𝘮","𝘔","𝙢","𝙈","𝙼","𝚖"];
const n = ["n","N","ñ","Ñ","ń","Ń","ņ","Ņ","ň","Ň","ŉ","ŋ","Ŋ","ǹ","Ǹ","ṅ","Ṅ","ṇ","Ṇ","ṉ","Ṉ","ṋ","Ṋ","ƞ","ɲ","ɳ","ɴ","ᴎ","η","Ν","ν","п","П","ռ","Ꮑ","⓷","Ⓝ","🄝","🄽","🅝","🅽","ｎ","Ｎ","𝐧","𝐍","𝑛","𝑁","𝒏","𝑵","𝓃","𝓝","𝓷","𝓝","𝔫","𝔑","𝕟","ℕ","𝕹","𝖓","𝖭","𝗇","𝗻","𝗡","𝘯","𝘕","𝙣","𝙉","𝙽","𝚗"];
const o = ["o","O","ò","Ò","ó","Ó","ô","Ô","õ","Õ","ö","Ö","ø","Ø","ō","Ō","ŏ","Ŏ","ő","Ő","ơ","Ơ","ǒ","Ǒ","ǿ","ȍ","Ȍ","ȏ","Ȏ","ɵ","ɔ","ᴏ","ọ","Ọ","ỏ","Ỏ","ố","Ố","ồ","Ồ","ổ","Ổ","ỗ","Ỗ","ộ","Ộ","ớ","Ớ","ờ","Ờ","ở","Ở","ỡ","Ỡ","ợ","Ợ","ⱺ","ⱸ","ο","Ο","о","О","ᴑ","Ꭷ","ⓞ","Ⓞ","🄞","🄾","🅞","🅾","ｏ","Ｏ","𝐨","𝐎","𝑜","𝑂","𝒐","𝑶","ℴ","𝒪","𝓸","𝓞","𝔬","𝔒","𝕠","𝕆","𝕺","𝖔","𝖮","𝗈","𝗼","𝗢","𝘰","𝘖","𝙤","𝙊","𝙾","𝚘"];
const p = ["p","P","ƥ","Ƥ","ᵽ","ᵱ","ɸ","ⱽ","ṕ","Ṕ","ṗ","Ṗ","ṕ","ṗ","ᵖ","ᴘ","ρ","Ρ","ϱ","ϼ","р","Р","Ꮲ","ⓟ","Ⓟ","🄟","🄿","🅟","🅿","ｐ","Ｐ","𝐩","𝐏","𝑝","𝑃","𝒑","𝑷","𝓅","𝒫","𝓹","𝓟","𝔭","𝔓","𝕡","ℙ","𝕻","𝖕","𝖯","𝗉","𝗽","𝗣","𝘱","𝘗","𝙥","𝙋","𝙿","𝚙"];
const q = ["q","Q","ɋ","ƣ","Ƣ","ʠ","Ɋ","ԛ","Ԛ","զ","ϙ","Ϙ","ⓠ","Ⓠ","🄠","🅀","🅠","🆀","ｑ","Ｑ","𝐪","𝐐","𝑞","𝑄","𝒒","𝑸","𝓆","𝒬","𝓺","𝓠","𝔮","𝔔","𝕢","ℚ","𝕼","𝖖","𝖰","𝗊","𝗾","𝗤","𝘲","𝘘","𝙦","𝙌","𝚀","𝚚"];
const r = ["r","R","ŕ","Ŕ","ŗ","Ŗ","ř","Ř","ȑ","Ȑ","ȓ","Ȓ","ɍ","Ɍ","ɼ","ɽ","ɾ","ɿ","ʀ","ᴙ","ṙ","Ṙ","ṛ","Ṛ","ṝ","Ṝ","ṟ","Ṟ","Ɽ","ɿ","ρ","Ρ","г","Г","ᴿ","ⓡ","Ⓡ","🄡","🅁","🅡","🆁","ｒ","Ｒ","𝐫","𝐑","𝑟","𝑅","𝒓","𝑹","𝓇","𝑅","𝓻","𝓡","𝔯","ℜ","𝕣","ℝ","𝕽","𝖗","𝖱","𝗋","𝗿","𝗥","𝘳","𝘙","𝙧","𝙍","𝚁","𝚛"];
const s = ["s","S","ś","Ś","ŝ","Ŝ","ş","Ş","š","Š","ș","Ș","ʂ","ȿ","ẜ","ṡ","Ṡ","ṣ","Ṣ","ṥ","Ṥ","ṧ","Ṧ","ṩ","Ṩ","ß","ƽ","Ƽ","ѕ","Ѕ","σ","Σ","ς","Ꮥ","ꜱ","ⓢ","Ⓢ","🄢","🅂","🅢","🆂","ｓ","Ｓ","𝐬","𝐒","𝑠","𝑆","𝒔","𝑺","𝓈","𝒮","𝓼","𝓢","𝔰","𝔖","𝕤","𝕊","𝕾","𝖘","𝖲","𝗌","𝘀","𝗦","𝘴","𝘚","𝙨","𝙎","𝚂","𝚜"];
const t = ["t","T","ť","Ť","ţ","Ţ","ŧ","Ŧ","ƭ","Ƭ","Ʈ","ȶ","Ⱦ","ŧ","ṭ","Ṭ","ṫ","Ṫ","ṯ","Ṯ","ṱ","Ṱ","ƚ","ʈ","ƾ","ᴛ","τ","Τ","т","Т","Ꭲ","ⓣ","Ⓣ","🄣","🅃","🅣","🆃","ｔ","Ｔ","𝐭","𝐓","𝑡","𝑇","𝒕","𝑻","𝓉","𝒯","𝓽","𝓣","𝔱","𝔗","𝕥","𝕋","𝕿","𝖙","𝖳","𝗍","𝘁","𝗧","𝘵","𝘛","𝙩","𝙏","𝚃","𝚝"];
const u = ["u","U","ù","Ù","ú","Ú","û","Û","ü","Ü","ũ","Ũ","ū","Ū","ŭ","Ŭ","ů","Ů","ű","Ű","ų","Ų","ư","Ư","ǔ","Ǔ","ǖ","Ǖ","ǘ","Ǘ","ǚ","Ǚ","ǜ","Ǜ","ȕ","Ȕ","ȗ","Ȗ","ʉ","ʊ","Ʉ","ṳ","Ṳ","ṵ","Ṵ","ṷ","Ṷ","ṹ","Ṹ","ụ","Ụ","ủ","Ủ","ứ","Ứ","ừ","Ừ","ử","Ử","ữ","Ữ","ự","Ự","μ","Μ","υ","Υ","ս","Ս","ᴜ","ⓤ","Ⓤ","🄤","🅄","🅤","🆄","ｕ","Ｕ","𝐮","𝐔","𝑢","𝑈","𝒖","𝑼","𝓊","𝒰","𝓾","𝓤","𝔲","𝔘","𝕦","𝕌","𝖀","𝖚","𝖴","𝗎","𝘂","𝗨","𝘶","𝘜","𝙪","𝙐","𝚄","𝚞"];
const v = ["v","V","ṽ","Ṽ","ṿ","Ṿ","Ʋ","ʋ","ⱱ","ⱽ","Ʌ","ʌ","ν","Ν","ѵ","Ѵ","Ꮩ","ᴠ","ⓥ","Ⓥ","🄥","🅅","🅥","🆅","ｖ","Ｖ","𝐯","𝐕","𝑣","𝑉","𝒗","𝑽","𝓋","𝒱","𝓿","𝓥","𝔳","𝔙","𝕧","𝕍","𝖁","𝖛","𝖵","𝗏","𝘃","𝗩","𝘷","𝘝","𝙫","𝙑","𝚅","𝚟"];
const w = ["w","W","ẁ","Ẁ","ẃ","Ẃ","ŵ","Ŵ","ẅ","Ẅ","ẇ","Ẇ","ẉ","Ẉ","ẘ","ⱳ","Ɯ","ɯ","ʍ","ᴡ","ω","Ω","ѡ","Ш","Ԝ","Ꮤ","ⓦ","Ⓦ","🄦","🅆","🅦","🆆","ｗ","Ｗ","𝐰","𝐖","𝑤","𝑊","𝒘","𝑾","𝓌","𝒲","𝔀","𝓦","𝔴","𝔚","𝕨","𝕎","𝖂","𝖜","𝖶","𝗐","𝘄","𝗪","𝘸","𝘞","𝙬","𝙒","𝚆","𝚠"];
const x = ["x","X","ẋ","Ẋ","ẍ","Ẍ","𝔁","𝕩","χ","Χ","х","Х","᙭","᙮","ⓧ","Ⓧ","🄧","🅇","🅧","🆇","ｘ","Ｘ","𝐱","𝐗","𝑥","𝑋","𝒙","𝑿","𝓍","𝒳","𝔁","𝓧","𝔵","𝔛","𝕩","𝕏","𝖃","𝖝","𝖷","𝗑","𝘅","𝗫","𝘹","𝘟","𝙭","𝙓","𝚇","𝚡"];
const y = ["y","Y","ý","Ý","ÿ","Ÿ","ŷ","Ŷ","ȳ","Ȳ","ẏ","Ẏ","ỵ","Ỵ","ỷ","Ỷ","ỹ","Ỹ","ƴ","Ƴ","ɏ","Ɏ","ʏ","γ","Γ","у","У","Ү","ү","Ꭹ","ⓨ","Ⓨ","🄨","🅈","🅨","🆈","ｙ","Ｙ","𝐲","𝐘","𝑦","𝑌","𝒚","𝒀","𝓎","𝒴","𝔂","𝓨","𝔶","𝔜","𝕪","𝕐","𝖄","𝖞","𝖸","𝗒","𝘆","𝗬","𝘺","𝘠","𝙮","𝙔","𝚈","𝚢"];
const z = ["z","Z","ź","Ź","ż","Ż","ž","Ž","ƶ","Ƶ","ȥ","Ȥ","ɀ","ʐ","ʑ","ẑ","Ẑ","ẓ","Ẓ","ẕ","Ẕ","ⱬ","Ⱬ","ᴢ","ζ","Ζ","ᴢ","Ꮓ","ⓩ","Ⓩ","🄩","🅉","🅩","🆉","ｚ","Ｚ","𝐳","𝐙","𝑧","𝑍","𝒛","𝒁","𝓏","𝒵","𝔃","𝓩","𝔷","ℨ","𝕫","ℤ","𝖅","𝖟","𝖹","𝗓","𝘇","𝗭","𝘻","𝘡","𝙯","𝙕","𝚉","𝚣"];
const Collection = {
    a, b, c, d, e, f, g, h, i, j, k, l, m, n, o, p, q, r, s, t, u, v, w, x, y, z
};

export const Map = {};
var Glyph_Count = 0;
for (const [character, list] of Object.entries(Collection)) {
    for (const from of list) {
        Map[from] = character;
        Glyph_Count += 1;
    }
}
console.log("Loaded " + Glyph_Count + " Glyphs.");

export const HomoglyphMapHelper = {
    normalize_homoglyphs,
    remove_noise,
    normalize_text
};

// converts Unicode confusables into their closest ASCII character.
function normalize_homoglyphs(text) {
    return [...text]
        .map(char => Map[char] ?? char)
        .join("");
}

// removes characters commonly used to bypass filters:
// spaces, punctuation, symbols, zero-width characters, etc.
function remove_noise(text) {
    return text
        .normalize("NFKD")
        .replace(/[\u200B-\u200D\uFEFF]/g, "") // zero-width chars
}

// normalize text content to be used for moderation
function normalize_text(text) {
    return remove_noise(
        normalize_homoglyphs(text.toLowerCase())
    );
}